In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

/home/ma/bin/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [2]:
arr = np.arange(12.).reshape(3,4)

In [3]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [4]:
obj = pd.Series([4, np.nan, 7, np.nan,-3,2])

In [5]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [6]:

obj_droped = obj.dropna()

In [7]:
obj_droped

0    4.0
2    7.0
4   -3.0
5    2.0
dtype: float64

In [8]:
type(obj_droped)

pandas.core.series.Series

In [10]:
data = pd.DataFrame([[1.,6.5, 3.],
                     [1,np.nan, np.nan],
                     [np.nan, np.nan, np.nan],
                     [np.nan, 6.5, 3.]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))

In [16]:
df.iloc[:4, 1] = np.nan

In [17]:
df.iloc[:2, 2] = np.nan

In [18]:
df

          0         1         2
0 -0.365069       NaN       NaN
1  0.883324       NaN       NaN
2  0.132715       NaN  1.625932
3  0.925602       NaN  2.031467
4  0.482534  0.309042  0.492611
5 -0.518635  2.066126  0.838493
6  0.905162 -1.272374 -1.687085

In [19]:
df.dropna()

          0         1         2
4  0.482534  0.309042  0.492611
5 -0.518635  2.066126  0.838493
6  0.905162 -1.272374 -1.687085

In [20]:
df.fillna(0)

          0         1         2
0 -0.365069  0.000000  0.000000
1  0.883324  0.000000  0.000000
2  0.132715  0.000000  1.625932
3  0.925602  0.000000  2.031467
4  0.482534  0.309042  0.492611
5 -0.518635  2.066126  0.838493
6  0.905162 -1.272374 -1.687085

In [21]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.365069  0.500000  0.000000
1  0.883324  0.500000  0.000000
2  0.132715  0.500000  1.625932
3  0.925602  0.500000  2.031467
4  0.482534  0.309042  0.492611
5 -0.518635  2.066126  0.838493
6  0.905162 -1.272374 -1.687085

In [22]:
data = pd.DataFrame(np.random.randn(1000,4))

In [23]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.039395    -0.057633    -0.010737     0.013886
std       0.996382     1.046481     0.948854     0.955037
min      -3.313658    -3.591254    -3.593819    -3.308643
25%      -0.572976    -0.763423    -0.671247    -0.637196
50%       0.063828    -0.088175    -0.019232    -0.031100
75%       0.687313     0.664138     0.608664     0.638842
max       3.086474     3.385530     3.189812     3.295835

In [26]:
col = data[2]

In [27]:
col[np.abs(col)>3]

5     -3.085076
74     3.189812
638   -3.222604
750   -3.593819
Name: 2, dtype: float64

In [28]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com','Wes': np.nan}

In [29]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [30]:
data_pd = pd.Series(data)

In [32]:
data_pd

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [33]:
data_pd.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [34]:
data_pd.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [35]:
data_pd.str[1]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [36]:
data_pd.str[:4]

Dave     dave
Steve    stev
Rob      rob@
Wes       NaN
dtype: object